/****************************************************************************************************************//**
*   @file               arch.h
*   @brief              Types, constants, and inlines for the x86_64 arch
*   @author             Adam Clark (hobbyos@eryjus.com)
*   @date               2022-Feb-26
*   @since              v0.0.0
*
*   @copyright          Copyright (c)  2022 -- Adam Clark\n
*                       Licensed under "THE BEER-WARE LICENSE"\n
*                       See \ref LICENSE.md for details.
*
*   Handle interacting with the serial port for the pc platform.
*
* ------------------------------------------------------------------------------------------------------------------
*
*   |     Date    | Tracker |  Version | Pgmr | Description
*   |:-----------:|:-------:|:--------:|:----:|:--------------------------------------------------------------------
*   | 2022-Feb-26 | Initial |  v0.0.0  | ADCL | Initial version
*
*///=================================================================================================================


#ifndef __ARCH_H__
#define __ARCH_H__


enum {
    PG_WRT = 0x00000001,                //!< VMM page is writable
    PG_DEV = 0x00000002,                //!< VMM page is not cacheable and it supervisor
    PG_KRN = 0x00000004,                //!< VMM Page is supervisor and is not swapable (but may be not present)
};


/****************************************************************************************************************//**
*   @typedef            size_t
*   @brief              An unsigned size of not less that 16 bit width
*///-----------------------------------------------------------------------------------------------------------------
typedef unsigned int size_t;
static_assert(sizeof(size_t) >= 2, "`size_t` must be 16 bits wide or more");


/****************************************************************************************************************//**
*   @typedef            uint64_t
*   @brief              An 8-byte (qword) unsigned integer
*///-----------------------------------------------------------------------------------------------------------------
typedef unsigned long uint64_t;
static_assert(sizeof(uint64_t) == 8, "`uint64_t` is not 8 bytes");


/****************************************************************************************************************//**
*   @typedef            uint32_t
*   @brief              A 4-byte (dword) unsigned integer
*///-----------------------------------------------------------------------------------------------------------------
typedef unsigned int uint32_t;
static_assert(sizeof(uint32_t) == 4, "`uint32_t` is not 4 bytes");


/****************************************************************************************************************//**
*   @typedef            uint16_t
*   @brief              A 2-byte (word) unsigned integer
*///-----------------------------------------------------------------------------------------------------------------
typedef unsigned short uint16_t;
static_assert(sizeof(uint16_t) == 2, "`uint16_t` is not 2 bytes");


/****************************************************************************************************************//**
*   @typedef            uint8_t
*   @brief              A 1-byte (byte) unsigned integer
*///-----------------------------------------------------------------------------------------------------------------
typedef unsigned char uint8_t;
static_assert(sizeof(uint8_t) == 1, "`uint8_t` is not 1 byte");


/****************************************************************************************************************//**
*   @typedef            int64_t
*   @brief              An 8-byte (qword) signed integer
*///-----------------------------------------------------------------------------------------------------------------
typedef long int64_t;
static_assert(sizeof(int64_t) == 8, "`int64_t` is not 8 bytes");


/****************************************************************************************************************//**
*   @typedef            int32_t
*   @brief              A 4-byte (dword) signed integer
*///-----------------------------------------------------------------------------------------------------------------
typedef int int32_t;
static_assert(sizeof(int32_t) == 4, "`int32_t` is not 4 bytes");


/****************************************************************************************************************//**
*   @typedef            int16_t
*   @brief              A 2-byte (word) signed integer
*///-----------------------------------------------------------------------------------------------------------------
typedef short int16_t;
static_assert(sizeof(int16_t) == 2, "`int16_t` is not 2 bytes");


/****************************************************************************************************************//**
*   @typedef            int8_t
*   @brief              A 1-byte (byte) signed integer
*///-----------------------------------------------------------------------------------------------------------------
typedef char int8_t;
static_assert(sizeof(int8_t) == 1, "`int8_t` is not 1 byte");


/****************************************************************************************************************//**
*   @typedef            Addr_t
*   @brief              The size of an address in this arch
*///-----------------------------------------------------------------------------------------------------------------
typedef uint64_t Addr_t;


/****************************************************************************************************************//**
*   @typedef            Frame_t
*   @brief              The size of a physical frame number
*///-----------------------------------------------------------------------------------------------------------------
typedef uint64_t Frame_t;


/****************************************************************************************************************//**
*   @struct             IdtDescriptor_t
